InformationRegisters/НастройкаОтраженияОперацийВУчете.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>НастройкаОтраженияОперацийВУчете</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Счет</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Финансовый</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЦФО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтатьяДоходовРасходов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДоходовРасходов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтатьяДвиженияТоваров</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиТовародвижения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтатьяДвиженияТоваров41</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиТовародвижения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДопРеквизит</Name>
					<Type>
						<v8:TypeSet>cfg:EnumRef</v8:TypeSet>
						<v8:TypeSet>cfg:ChartOfAccountsRef</v8:TypeSet>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДопРеквизит1</Name>
					<Type>
						<v8:TypeSet>cfg:EnumRef</v8:TypeSet>
						<v8:TypeSet>cfg:ChartOfAccountsRef</v8:TypeSet>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДопСтатьяДвиженияТоваров</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиТовародвижения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийВУчете</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/НастройкаОтраженияОперацийВУчете/Forms/ФормаЗаписиУправляемая/Ext/Form/Module.bsl
Процедура УстановитьВидимостьЭлементов()
	
	Счет41 = (Запись.Счет = ПланыСчетов.Финансовый.Товары
				ИЛИ Запись.Счет = ПланыСчетов.Финансовый.МатералыДляВыпуска);
		
	Элементы.СтатьяДоходовРасходов.Видимость 	= НЕ Счет41;
	Элементы.ЦФО.Видимость 						= НЕ Счет41;
	Элементы.СтруктурнаяЕдиница.Видимость 		= НЕ Счет41;
	Элементы.СтатьяДвиженияТоваров41.Видимость 	= Счет41;
	
КонецПроцедуры

Процедура ПроверитьДоступностьПериода(мПериод, мОрганизация, Отказ)
	
	НаборЗаписей = РегистрыСведений.НастройкаОтраженияОперацийВУчете.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Период.Установить(мПериод, Истина);
	//+++АК Susk (Суслин К.В.) 2018.12.04 ИП-00020497	 
	НаборЗаписей.Отбор.Организация.Установить(мОрганизация, Истина);
	//---АК Susk (Суслин К.В.) 
	НаборЗаписей.Прочитать();
	
	НастройкаПравДоступа.ПередЗаписьюРегистраСведенийПроверкаДоступностиПериода(НаборЗаписей, Отказ, Неопределено);
	
КонецПроцедуры


&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	//
	//+++АК Susk (Суслин К.В.) 2018.12.04 ИП-00020497	 
	//ПроверитьДоступностьПериода(ЭтаФорма.Запись.Период, Отказ);
	ПроверитьДоступностьПериода(ЭтаФорма.Запись.Период, Запись.Организация, Отказ);
	//---АК Susk (Суслин К.В.) 
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьВидимостьЭлементов();
	
КонецПроцедуры


&НаКлиенте
Процедура СчетПриИзменении(Элемент)
	
	УстановитьВидимостьЭлементов();
	
КонецПроцедуры
